app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def home
    if four_hours_passed
      nprfeed()
      redditfeed()
    end
    render :json => Article.all